In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.DataFrame([['rohit',23,'exc',20000],
['rahul',26,'Sr exc',25000],
['ram',28,'jr exc',18000],
['roshan',21,'exc',21000],
['ratul',22,'Sr exc',26000],
['rony',25,'exc',19500]],
columns = ['Name','Age','Designation','Salary'])

In [3]:
df.head()

     Name  Age Designation  Salary
0   rohit   23         exc   20000
1   rahul   26      Sr exc   25000
2     ram   28      jr exc   18000
3  roshan   21         exc   21000
4   ratul   22      Sr exc   26000

In [4]:
x = df[['Name','Age','Designation']]
y = df[['Salary']]

In [5]:
x.head()

     Name  Age Designation
0   rohit   23         exc
1   rahul   26      Sr exc
2     ram   28      jr exc
3  roshan   21         exc
4   ratul   22      Sr exc

In [6]:
y.head()

   Salary
0   20000
1   25000
2   18000
3   21000
4   26000

In [7]:
x.drop(['Name'],axis = 1,inplace = True)

C:\Users\sengu\AppData\Local\Temp\ipykernel_22108\1164577966.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x.drop(['Name'],axis = 1,inplace = True)

In [8]:
x.head()

   Age Designation
0   23         exc
1   26      Sr exc
2   28      jr exc
3   21         exc
4   22      Sr exc

In [9]:
from sklearn.preprocessing import OneHotEncoder

In [10]:
enc = OneHotEncoder()

In [11]:
enc_data = pd.DataFrame(enc.fit_transform(x[['Designation']]).toarray())

In [12]:
enc_data

     0    1    2
0  0.0  1.0  0.0
1  1.0  0.0  0.0
2  0.0  0.0  1.0
3  0.0  1.0  0.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [13]:
x = x.join(enc_data)

In [14]:
x.head()

   Age Designation    0    1    2
0   23         exc  0.0  1.0  0.0
1   26      Sr exc  1.0  0.0  0.0
2   28      jr exc  0.0  0.0  1.0
3   21         exc  0.0  1.0  0.0
4   22      Sr exc  1.0  0.0  0.0

In [16]:
x.drop(['Designation'],axis = 1,inplace = True)

In [17]:
x.head()

   Age    0    1    2
0   23  0.0  1.0  0.0
1   26  1.0  0.0  0.0
2   28  0.0  0.0  1.0
3   21  0.0  1.0  0.0
4   22  1.0  0.0  0.0

In [18]:
x.columns = ['Age','Sr Exc','Exc','Jr Exc']

In [19]:
x.head()

   Age  Sr Exc  Exc  Jr Exc
0   23     0.0  1.0     0.0
1   26     1.0  0.0     0.0
2   28     0.0  0.0     1.0
3   21     0.0  1.0     0.0
4   22     1.0  0.0     0.0

In [20]:
from sklearn.model_selection import train_test_split

In [21]:
xtrain,xtest,ytrain,ytest = train_test_split(x,y,test_size=0.2)

In [22]:
from sklearn.linear_model import LinearRegression

In [23]:
lr = LinearRegression()

In [24]:
model = lr.fit(xtrain,ytrain)

In [25]:
ytest

   Salary
3   21000
5   19500

In [26]:
ypred = model.predict(xtest)

In [27]:
ypred

array([[20500.],
       [19500.]])

In [28]:
model.score(xtest,ytest)

0.7777777777777778

#### Regularazations

xtrain

In [29]:
xtrain

   Age  Sr Exc  Exc  Jr Exc
0   23     0.0  1.0     0.0
2   28     0.0  0.0     1.0
1   26     1.0  0.0     0.0
4   22     1.0  0.0     0.0

In [30]:
model.score(xtrain,ytrain)

1.0

In [31]:
#### Overfitting

#### L1 - Ridge Regression
#### L2 - Lasso Regression

In [35]:
boston = pd.read_csv('boston.csv')

In [36]:
boston.head()

,crim,zn,indus,chas,nox,rm,age,dis,rad,tax,ptratio,b,lstat,medv
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2

In [80]:
y = boston[['medv']]
x = boston[['crim','zn','indus','chas','nox','rm']]

In [81]:
y.head()

   medv
0  24.0
1  21.6
2  34.7
3  33.4
4  36.2

In [82]:
x

        crim    zn  indus  chas    nox     rm
0    0.00632  18.0   2.31     0  0.538  6.575
1    0.02731   0.0   7.07     0  0.469  6.421
2    0.02729   0.0   7.07     0  0.469  7.185
3    0.03237   0.0   2.18     0  0.458  6.998
4    0.06905   0.0   2.18     0  0.458  7.147
..       ...   ...    ...   ...    ...    ...
501  0.06263   0.0  11.93     0  0.573  6.593
502  0.04527   0.0  11.93     0  0.573  6.120
503  0.06076   0.0  11.93     0  0.573  6.976
504  0.10959   0.0  11.93     0  0.573  6.794
505  0.04741   0.0  11.93     0  0.573  6.030

[506 rows x 6 columns]

In [83]:
x.shape

(506, 6)

In [84]:
y.shape

(506, 1)

In [85]:
xtrain,xtest,ytrain,ytest = train_test_split(x,y,test_size=0.3)

In [86]:
lr = LinearRegression().fit(xtrain,ytrain)

In [87]:
lr.score(xtrain,ytrain)

0.5599936106212156

In [88]:
lr.score(xtest,ytest)

0.6391455459828785

In [89]:
from sklearn.linear_model import Ridge

In [90]:
ridge = Ridge().fit(xtrain,ytrain)

In [91]:
ridge.score(xtrain,ytrain)

0.5592263939229754

In [92]:
ridge.score(xtest,ytest)

0.6429221670900345

In [93]:
### Ridge , alpha
### Co efficient 
ridge = Ridge(alpha=0.9).fit(xtrain,ytrain)
ridge.score(xtest,ytest)

0.6426960791534286

In [94]:
### Lasso

from sklearn.linear_model import Lasso

In [95]:
lasso = Lasso(alpha = 0.01 , max_iter = 100000).fit(xtrain,ytrain)

In [96]:
lasso.score(xtest,ytest)

0.6416350902559245